package Repeat;

public class MyClass {
    int a;

    int a(int a) {
        {/*другая область видимости в рамках метода
        мы можем работать внутри нее с внешними данными,
        например a=17 будет всегда менять входящее значение а в методе а
        но например если определим в этой области b, то вызвать ее в методе не получится
        получим ошибку, что переменной не существует
        */
            a = 17;
            this.a = 19;
            int b=1;
        }
//        return b;//будет ругаться на то, что переменной нет,
//        т.к. она определена во внутренней области, недоступной в методе
        return 0;
    }

    int getA() {
        int res = this.a(123);
        return this.a;
    }
}